Repository: martingri/CorvaxHome
Catalog: module/GrimelandCoding/language/*.po
Languages: nb_no

source: ABOUT
nb_no: OM

source: EXPERTISE
nb_no: TJENESTER

source: REFERENCES
nb_no: REFERANSER

source: CONTACT US
nb_no: TA KONTAKT

source: Home
nb_no: Hjem

source: All rights reserved.
nb_no: Alle rettigheter reservert.

source: An error occurred
nb_no: En feil har oppstått

source: Additional information
nb_no: Ytterligere informasjon

source: File
nb_no: Fil

source: Message
nb_no: Beskjed

source: Stack trace
nb_no: Stakkspor

source: Previous exceptions
nb_no: Forrige unntak

source: No Exception available
nb_no: Ingen unntak tilgjengelig

source: A 404 error occurred
nb_no: En 404 feil oppsto

source: The requested controller was unable to dispatch the request.
nb_no: Den valgte kontrolleren kunne ikke håndtere forespørselen.

source: The requested controller could not be mapped to an existing controller class.
nb_no: Den valgte kontrolleren kunne ikke knyttes opp mot en eksisterende kontrollerklasse.

source: The requested controller was not dispatchable.
nb_no: Den forspurte kontrolleren kunne ikke brukes.

source: The requested URL could not be matched by routing.
nb_no: Den angitte URL kunne ikke finnes i rutingoppsettet

source: We cannot determine at this time why a 404 was generated.
nb_no: På dette tidspunkt kan vi ikke bestemme årsaken til at en 404 ble generert.

source: Controller
nb_no: Kontroller

source: resolves to %s
nb_no: løser til %s

source: elevator pitch grimeland coding
nb_no: Grimeland Coding vil lede produktutviklingen i din nye satsning, styrke ditt utviklingsteam, eller midlertidig erstatte et sentralt team-medlem.

source: About Grimeland Coding
nb_no: Om Grimeland Coding

source: who is grimeland coding intro
nb_no: Jeg heter Martin Grimeland og har jobbet med IT siden 2006. Gjennom Grimeland Coding leverer jeg IT-konsulentarbeid som systemutvikler og clean code workshops.

source: who is grimeland coding 1
nb_no: Jeg er en Clean Code evangelist og brenner for å løfte kodekvaliteten i bransjen. Derfor har jeg utviklet og holdt workshops i Clean Code og sett gode resultater.

source: who is grimeland coding 2
nb_no: I hovedsak jobber jeg som systemutvikler i backend, ofte som Lead Developer og har ansvar for utvikling og leveranse. Som Lead Developer har jeg jobbet mye med å ta konsepter fra idé til ferdig produkt.

source: who is grimeland coding 3
nb_no: Mine styrker som utvikler er evnen til å se helheten i hva vi lager og mitt fokus på å skape verdi for sluttbruker. Jeg tror på en pragmatisk og smidig tilnærming til hvordan man kommer seg til neste steg i produktutviklingen.

source: Expertise
nb_no: Tjenester

source: describe grimeland coding lead developer
nb_no: En Lead Developer eller tech lead tar ledelse og ansvar i utviklingsteamet, leder prosesser for teknologivalg, tar ansvar for arkitektur og infrastruktur, i tillegg til å etablere utviklingsmiljø og utviklingsmetodikk.

source: describe strength as lead developer
nb_no: Som Lead Developer kan jeg øke produktivitet og heve kvaliteten på teamets leveranser. Jeg jobber fokusert og effektivt med gode kommunikasjonsevner og fungerer som et bindeledd mellom utviklingsteam og prosjektleder.

source: Senior System Developer
nb_no: Senior Systemutvikler

source: describe grimeland coding senior system developer
nb_no: Som en senior utvikler jobber man i team alene på et konkret prosjekt. En senior utvikler er tilgjengelig og lett å stille spørsmål til for de andre på teamet i tillegg til at man har erfaring med å snakke med interessenter utenfor teamet.

source: describe strength as senior system developer
nb_no: Det er backend-løsningen og forretningslogikk jeg har jobbet mest med. Forruten programmering og clean code har jeg høy kompetanse på arkitektur, infrastruktur, utviklingsprosesser og testing. Min styrke som systemutvikler er at jeg setter meg fort inn i nye systemer og blir raskt produktiv, jeg fokuserer på effektiv, lesbar og forståelig kode som alltid er av høy kvalitet og lett for andre å forstå.

source: describe grimeland coding agile coach
nb_no: En smidig prosjektleder eller smidig coach jobber med utviklingsteamet for å sikre en god gjennomføring av et smidig prosjekt. Jeg syns at en god smidig coach skal sørge for godt samarbeid i teamet og passe på at utviklere får jobbe fokusert samtidig som interessene til produkteier er ivaretatt.

source: describe strength as coding agile coach
nb_no: Jeg har mye erfaring som Scrum master og som smidig coach i Kanbanprosjekter. Min styrke er at jeg jobber organisert og strukturert og bruker utviklingsprosesser som hever kvalitet og produktivitet for å sikre gode leveranser.

source: describe grimeland coding clean code workshops
nb_no: Clean Code er et begrep introdusert av Robert C. Martin og er en praksis der man skriver elegant og strukturert kode på en organisert måte som gjør det lettere å lese og forstå. Dersom alle utviklere i et team følger de samme prinsippende og alle fokuserer på å skrive kode som er lett å lese, forbedres kommunikasjon, produktivitet øker og det gjør det lettere å samarbeide.

source: describe strength with clean code workshops
nb_no: Mange selskaper satser på å forbedre samarbeid blant utviklerene deres ved å etablere en kodestandard som alle skal følge. Jeg har jobbet med mangle slike prosesser og min erfaring er at de fleste, om ikke alle, mislykkes i å gjennomføre det på grunn av de personlig preferansene til utviklerene. Det er viktig å motivere de involverte til å etablere enighet og begrunne bruk av god praksis. Ofte vil det være letter for en utenforstående å håndtere denne prosessen slik at man unngår interne konflikter. I mine Clean Code workshops oppfordres deltakere til lagarbeid og man åpner for dialog rundt clean code konseptet ved å kombinere hver workshop med et sett utfordringer som i tillegg gir deltakere en dypere forståelse og praktisk erfaring.

source: References
nb_no: Referanser

source: describe grimeland coding sysco as
nb_no: Senior Konsulent/Prosjektleder med ansvar for å koordinere og lede oppdrag i Lima for norske kunder.

source: describe grimeland coding vidum
nb_no: Jobbet som Scrum Master med høye krav til oppfølging av prosjektrammene.

source: describe grimeland coding pplan
nb_no: Scrum Master for prosjektet PPlan og jobbet tett med oppdragsgiver for å utarbeide produktspesifikasjon.

source: describe grimeland coding orchestration
nb_no: Senior Systemutvikler med rolle som hovedutvikler og systemarkitekt for Orchestration sin produktsatsning. Utleid til større prosjekter som senior systemutvikler.

source: describe grimeland coding meetv
nb_no: Vikar for den tekniske lederen av prosjektet MeeTV for ABC Startsiden med ansvaret for videreutvikling av løsningen inkludert arkitektur og teknologivalg.

source: describe grimeland coding onsite
nb_no: Jobbet som systemutvikler på avanserte webbaserte tjenester og applikasjoner. Jobbet også med koordinering og planlegging av teknisk gjennomføring av prosjekter.

source: describe grimeland coding avspark
nb_no: Hovedutvikler av den nettbaserte tjenesten Avspark.no for ABC-Startsiden. Jobbet som en teknisk prosjektleder og hovedutvikler, med ansvaret for systemarkitektur og valg av teknologi.

source: describe grimeland coding conductor
nb_no: Hovedutvikler for utviklingen av webapplikasjonen Conductor. Hadde hovedansvaret som systemarkitekt og tech-lead i tillegg til å ha rollen som Scrum Master

source: describe grimeland coding Norsk Tipping
nb_no: Seniorutvikler i Norsk Tipping sitt prosjekt for fornying av web-løsning. Jobbet som seniorutvikler med en rolle som løsningsrådgiver. Var involvert ved valg av teknologi og arkitektur under føringer fra Norsk Tipping. Jobbet i tillegg som hovedutvikler i utvalgte moduler.

source: contact grimeland coding
nb_no: Kontakt Grimeland Coding

source: contact-motivation
nb_no: Jeg er ledig for oppdrag og gleder meg til å høre fra deg.
